server/wapartners/100_Automating_Serverless_Best_Practices_with_Dashbird/Code/oncall-health-sample-app/artillery_load_test/test.yaml
config:
  target: '<Your API Invoke URL>'
  phases:
    - duration: 10
      arrivalRate: 200
  processor: "./loadTestFunction.js"
  defaults:
    headers:
      Authorization: 'Bearer <Your Auth Token>'
scenarios:
  - flow:
    - function: "generateRandomData"
    - post:
        url: "/ride"
        json:
          PickupLocation:
            Latitude: {{ lat }}
            Longitude: {{ lng }}